TexasInstruments/motor-control-sdk/examples/time_sync/time_sync_time_transmitter_receiver/am243x-evm/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM243x_ALV_beta" --part "ALV" --package "ALV" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@2025.00.00" --product "INDUSTRIAL_COMMUNICATIONS_SDK@2025.00.00" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2434" --package "FCBGA (ALV)" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@2025.00.00" --product "INDUSTRIAL_COMMUNICATIONS_SDK@2025.00.00" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const pruicss         = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1        = pruicss.addInstance();
const pruicss2        = pruicss.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
gpio1.pinDir         = "OUTPUT";
gpio1.$name          = "TIMESYNC_DEBUG";
gpio1.GPIO_n.$assign = "PRG0_PRU0_GPO1";

i2c1.$name           = "CONFIG_I2C0";
i2c1.enableIntr      = false;
i2c1.I2C.$assign     = "I2C1";
i2c1.I2C.SCL.$assign = "I2C1_SCL";
i2c1.I2C.SDA.$assign = "I2C1_SDA";
i2c1.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template0";

pruicss1.$name                                                                      = "CONFIG_PRU_ICSS0";
pruicss1.iepSyncMode                                                                = true;
pruicss1.AdditionalICSSSettings[0].$name                                            = "CONFIG_PRU_ICSS_IO0";
pruicss1.AdditionalICSSSettings[0].PruIepIO.create(1);
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].$name                                = "CONFIG_PRU_ICSS_IEP_IO0";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.$assign               = "PRU_ICSSG0_IEP0";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.EDC_SYNC_OUT0.$assign = "PRG0_PRU0_GPO19";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG0_IEP.EDC_SYNC_OUT0.$used   = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm.create(3);
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].$name                              = "CONFIG_PRUICSS_PWM0";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.$assign             = "PRU_ICSSG0_PWM0";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.A0.$assign          = "PRG0_PRU0_GPO12";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.A0.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.A1.$assign          = "PRG0_PRU0_GPO14";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.A1.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.A2.$assign          = "PRG0_PRU0_GPO16";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.A2.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.B0.$assign          = "PRG0_PRU0_GPO13";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.B0.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.B1.$assign          = "PRG0_PRU0_GPO15";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.B1.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.B2.$assign          = "PRG0_PRU0_GPO17";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG0_PWM.B2.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].$name                              = "CONFIG_PRUICSS_PWM1";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.$assign             = "PRU_ICSSG0_PWM1";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.A0.$assign          = "PRG0_PRU1_GPO12";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.A0.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.A1.$assign          = "PRG0_PRU1_GPO14";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.A1.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.A2.$assign          = "PRG0_PRU1_GPO16";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.A2.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.B0.$assign          = "PRG0_PRU1_GPO13";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.B0.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.B1.$assign          = "PRG0_PRU1_GPO15";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.B1.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.B2.$assign          = "PRG0_PRU1_GPO17";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG0_PWM.B2.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].$name                              = "CONFIG_PRUICSS_PWM2";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.$assign             = "PRU_ICSSG0_PWM2";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.A0.$assign          = "GPMC0_AD3";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.A0.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.A1.$assign          = "GPMC0_AD5";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.A1.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.A2.$assign          = "GPMC0_AD8";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.A2.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.B0.$assign          = "GPMC0_AD4";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.B0.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.B1.$assign          = "GPMC0_AD6";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.B1.$used            = true;
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.B2.$assign          = "GPMC0_AD9";
pruicss1.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG0_PWM.B2.$used            = true;

pruicss2.$name                                                                      = "CONFIG_PRU_ICSS1";
pruicss2.instance                                                                   = "ICSSG1";
pruicss2.iepSyncMode                                                                = true;
pruicss2.AdditionalICSSSettings[0].$name                                            = "CONFIG_PRU_ICSS_IO1";
pruicss2.AdditionalICSSSettings[0].PruIepIO.create(1);
pruicss2.AdditionalICSSSettings[0].PruIepIO[0].$name                                = "CONFIG_PRU_ICSS_IEP_IO1";
pruicss2.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG1_IEP.$assign               = "PRU_ICSSG1_IEP0";
pruicss2.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG1_IEP.EDC_SYNC_OUT0.$assign = "PRG1_PRU0_GPO19";
pruicss2.AdditionalICSSSettings[0].PruIepIO[0].PRU_ICSSG1_IEP.EDC_SYNC_OUT0.$used   = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm.create(3);
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].$name                              = "CONFIG_PRUICSS_PWM3";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.$assign             = "PRU_ICSSG1_PWM0";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.A0.$assign          = "PRG1_PRU0_GPO12";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.A0.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.A1.$assign          = "PRG1_PRU0_GPO14";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.A1.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.A2.$assign          = "PRG1_PRU0_GPO16";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.A2.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.B0.$assign          = "PRG1_PRU0_GPO13";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.B0.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.B1.$assign          = "PRG1_PRU0_GPO15";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.B1.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.B2.$assign          = "PRG1_PRU0_GPO17";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[0].PRU_ICSSG1_PWM.B2.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].$name                              = "CONFIG_PRUICSS_PWM4";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.$assign             = "PRU_ICSSG1_PWM1";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.A0.$assign          = "PRG1_PRU1_GPO12";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.A0.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.A1.$assign          = "PRG1_PRU1_GPO14";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.A1.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.A2.$assign          = "PRG1_PRU1_GPO16";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.A2.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.B0.$assign          = "PRG1_PRU1_GPO13";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.B0.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.B1.$assign          = "PRG1_PRU1_GPO15";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.B1.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.B2.$assign          = "PRG1_PRU1_GPO17";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[1].PRU_ICSSG1_PWM.B2.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].$name                              = "CONFIG_PRUICSS_PWM5";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.$assign             = "PRU_ICSSG1_PWM2";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.A0.$assign          = "GPMC0_WPn";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.A0.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.A1.$assign          = "GPMC0_BE0n_CLE";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.A1.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.A2.$assign          = "GPMC0_AD7";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.A2.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.B0.$assign          = "GPMC0_DIR";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.B0.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.B1.$assign          = "GPMC0_WAIT1";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.B1.$used            = true;
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.B2.$assign          = "GPMC0_AD10";
pruicss2.AdditionalICSSSettings[0].PruIcssPwm[2].PRU_ICSSG1_PWM.B2.$used            = true;

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign     = "USART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";

const uart_v0_template  = scripting.addModule("/drivers/uart/v0/uart_v0_template", {}, false);
const uart_v0_template1 = uart_v0_template.addInstance({}, false);
uart_v0_template1.$name = "drivers_uart_v0_uart_v0_template0";
debug_log.uartLog.child = uart_v0_template1;

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

